In [2]:
import mysql.connector as connection
import pandas as pd

In [3]:
import json
file=open("C://Users//91964//Desktop//My_sql_details.json")
mysql=json.load(file)
file.close()

host=mysql['host']
user=mysql['user']
passwd=mysql['passwd']

In [4]:
# fetching data from database 
try:
    my_db=connection.connect(host=host,user=user,passwd=passwd,
                             database='Used_cars',use_pure=True)
    
    query="SELECT * FROM car_details;"
    
    cursor=my_db.cursor()
    
    cursor.execute(query)
    table=cursor.fetchall()
    my_db.close()
    
except Exception as e:
    print("Data cannot be fetched from database", str(e))

In [5]:
# converting the data into Dataframe to clean the data using pandas
columns=['Name','Price','Distance_travelled','Date_of_purchase','Ownership',
         'Fuel_type','Transmission','RTO','Insurance_type','City']
df=pd.DataFrame(table,columns=columns)

In [6]:
df.head()

,Name,Price,Distance_travelled,Date_of_purchase,Ownership,Fuel_type,Transmission,RTO,Insurance_type,City
0,Maruti Wagon R 1.0 VXI,239899,12501,March 2011,First,Petrol,MANUAL,RTODL3C,Comp,NewDelhi
1,Maruti Alto K10 LXI,178099,34028,July 2011,First,Petrol,MANUAL,RTODL9C,Third Party,NewDelhi
2,Maruti Swift ZDI,394199,24022,May 2013,First,Diesel,MANUAL,RTODL3C,Comp,NewDelhi
3,Hyundai Santro Xing GL PLUS,231299,35726,November 2013,Second,Petrol,MANUAL,RTODL9C,Third_party,NewDelhi
4,Hyundai Grand i10 Sportz(O) 1.2 MT,452899,19994,November 2017,Second,Petrol,MANUAL,RTODL1C,Zero_Dep,NewDelhi

In [7]:
#RTO column is not needed drop RTO column

In [8]:
df.drop('RTO',axis=1,inplace=True)

In [9]:
df.head()

,Name,Price,Distance_travelled,Date_of_purchase,Ownership,Fuel_type,Transmission,Insurance_type,City
0,Maruti Wagon R 1.0 VXI,239899,12501,March 2011,First,Petrol,MANUAL,Comp,NewDelhi
1,Maruti Alto K10 LXI,178099,34028,July 2011,First,Petrol,MANUAL,Third Party,NewDelhi
2,Maruti Swift ZDI,394199,24022,May 2013,First,Diesel,MANUAL,Comp,NewDelhi
3,Hyundai Santro Xing GL PLUS,231299,35726,November 2013,Second,Petrol,MANUAL,Third_party,NewDelhi
4,Hyundai Grand i10 Sportz(O) 1.2 MT,452899,19994,November 2017,Second,Petrol,MANUAL,Zero_Dep,NewDelhi

In [10]:
# checking the features of dataframe.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4776 entries, 0 to 4775
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                4776 non-null   object
 1   Price               4776 non-null   object
 2   Distance_travelled  4776 non-null   object
 3   Date_of_purchase    4776 non-null   object
 4   Ownership           4776 non-null   object
 5   Fuel_type           4776 non-null   object
 6   Transmission        4776 non-null   object
 7   Insurance_type      4776 non-null   object
 8   City                4776 non-null   object
dtypes: object(9)
memory usage: 335.9+ KB

In [11]:
df[df.duplicated()]

,Name,Price,Distance_travelled,Date_of_purchase,Ownership,Fuel_type,Transmission,Insurance_type,City
360,Toyota Etios Liva GD,259999,160408,May 2012,First,Diesel,MANUAL,Comp,NewDelhi
740,Hyundai Elite i20 ASTA 1.2,525499,45517,April 2017,First,Petrol,MANUAL,Zero_Dep,NewDelhi
800,Volkswagen Vento HIGHLINE PETROL,237899,162665,March 2011,Second,Petrol,MANUAL,Comp,NewDelhi
860,Maruti Swift LXI 1.3,70000,80391,March 2006,Second,Petrol,MANUAL,Third Party,NewDelhi
900,Chevrolet Enjoy 1.3 LT 7 STR,215000,46576,May 2013,First,Diesel,MANUAL,Comprehensive,NewDelhi
980,Renault Duster RXZ DIESEL 110,450000,74195,January 2013,First,Diesel,MANUAL,Comprehensive,NewDelhi
1770,Maruti Swift Dzire VDI BS IV,415599,133678,January 2012,First,Diesel,MANUAL,Third_party,Mumbai

In [12]:
df.drop_duplicates(inplace=True)

Name column can be split into two columns for company name and model name.

In [13]:
df['Company_name']=df['Name'].apply(lambda x: x.split()[0] )

In [14]:
df['Company_name'].value_counts()

Maruti        2203
Hyundai       1109
Honda          351
Toyota         254
Volkswagen     144
Mahindra       144
Ford           122
Renault        121
Tata            81
Skoda           35
Chevrolet       33
Mercedes        32
Nissan          31
BMW             20
Audi            19
Datsun          17
KIA             12
MG              12
Jeep             8
Fiat             8
Ssangyong        4
Mitsubishi       3
Jaguar           2
Volvo            2
Name             1
Opel             1
Name: Company_name, dtype: int64

Remove company names with less than 5 cars.

In [60]:
ind=df[(df['Company_name']=='Ssangyong')|(df['Company_name']=='Mitsubishi')|(df['Company_name']=='Jaguar')].index
df.drop(ind,inplace=True)

In [61]:
ind=df[(df['Company_name']=='Volvo')|(df['Company_name']=='Name')|(df['Company_name']=='Opel')].index
df.drop(ind,inplace=True)

In [15]:
df['Model_name']=df['Name'].apply(lambda x: ' '.join(x.split()[1:]))

In [64]:
df['Model_name'].value_counts()

Alto 800 LXI               135
Wagon R 1.0 VXI            134
Swift VDI                  114
Alto K10 VXI               108
Swift VXI                  104
                          ...
Spark E 1.0                  1
Ertiga ZXI SMART HYBRID      1
ALTROZ XT 1.2                1
Xcent BASE 1.1 CRDI          1
Harrier XZA PLUS             1
Name: Model_name, Length: 946, dtype: int64

In price column there categorical 'price' and value of '0' which shoould be removed

In [17]:
i=df[df['Price']=='Price'].index

In [18]:
df.drop(i,inplace=True)

In [19]:
i=df[df['Price']=='0'].index

In [20]:
df.drop(i,inplace=True)

In [21]:
df[df['Price']==0]

Empty DataFrame
Columns: [Name, Price, Distance_travelled, Date_of_purchase, Ownership, Fuel_type, Transmission, Insurance_type, City, Company_name, Model_name]
Index: []

In [22]:
df[df['Price']=='Price']

Empty DataFrame
Columns: [Name, Price, Distance_travelled, Date_of_purchase, Ownership, Fuel_type, Transmission, Insurance_type, City, Company_name, Model_name]
Index: []

Converting numerical columns to int type and date column to datetime

In [23]:
df['Price']=df['Price'].astype('int64')

In [24]:
df['Distance_travelled']=df['Distance_travelled'].astype('int64')

In [25]:
df['Date_of_purchase']=df['Date_of_purchase'].astype('datetime64')

In [26]:
df['Ownership'].value_counts()

First     3432
Second    1131
Third      175
Fourth      24
Fifth        2
Sixth        1
Name: Ownership, dtype: int64

Remove the fifth and sixth ownership as they are very low in number that might be outliers and can couse noise in the datasetd

In [46]:
ind=df[(df['Ownership']=='Fifth') | (df['Ownership']=='Sixth')].index
df.drop(ind,inplace=True)

In [27]:
df['Fuel_type'].value_counts()

Petrol          2939
Diesel          1588
Petrol + CNG     215
Petrol + LPG      20
Electric           3
Name: Fuel_type, dtype: int64

Remove Fuel_type- Electric as it might cause noise in the data

In [47]:
ind=df[df['Fuel_type']=='Electric'].index
df.drop(ind,inplace=True)

In [48]:
df['Transmission'].value_counts()

MANUAL       4361
AUTOMATIC     398
Name: Transmission, dtype: int64

In [49]:
df['Insurance_type'].value_counts()

Comprehensive        2107
Third Party          1673
Zero Depreciation     741
Insurance Expired     180
Not Available          58
Name: Insurance_type, dtype: int64

In [30]:
d={'Comp':'Comprehensive','Third_party':'Third Party','3rd Party':'Third Party',
  'Zero_Dep':'Zero Depreciation','null':'Not Available','NA':'Not Available'}

#df['Insurance_type'].apply(lambda x:x.replace(key,values) for key,values in d.items())

In [31]:
for key,values in d.items():
    df['Insurance_type']=df['Insurance_type'].apply(lambda x:x.replace(key,values) )

In [32]:
df['Insurance_type'].value_counts()

Comprehensive             1964
Third Party               1675
Zero Depreciation          742
Insurance Expired          182
Comprehensiverehensive     144
Not Available               58
Name: Insurance_type, dtype: int64

In [33]:
df['Insurance_type']=df['Insurance_type'].replace('Comprehensiverehensive','Comprehensive')

In [34]:
df['Insurance_type'].value_counts()

Comprehensive        2108
Third Party          1675
Zero Depreciation     742
Insurance Expired     182
Not Available          58
Name: Insurance_type, dtype: int64

In [35]:
df.City.value_counts()

NewDelhi     1025
Mumbai        852
Bangalore     657
Chennai       544
Pune          514
Hyderabad     426
Ahmedabad     313
Noida         243
Gurgaon       113
Kolkata        78
Name: City, dtype: int64

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4747 entries, 0 to 4775
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                4747 non-null   object
 1   Price               4747 non-null   int64
 2   Distance_travelled  4747 non-null   int64
 3   Date_of_purchase    4747 non-null   datetime64[ns]
 4   Ownership           4747 non-null   object
 5   Fuel_type           4747 non-null   object
 6   Transmission        4747 non-null   object
 7   Insurance_type      4747 non-null   object
 8   City                4747 non-null   object
 9   Company_name        4747 non-null   object
 10  Model_name          4747 non-null   object
dtypes: datetime64[ns](1), int64(2), object(8)
memory usage: 445.0+ KB

In [66]:
df['Company_name'].value_counts()

Maruti        2201
Hyundai       1107
Honda          350
Toyota         254
Volkswagen     144
Mahindra       141
Ford           122
Renault        121
Tata            80
Skoda           35
Chevrolet       33
Mercedes        32
Nissan          31
BMW             20
Audi            19
Datsun          17
KIA             12
MG              12
Jeep             8
Fiat             8
Name: Company_name, dtype: int64

In [68]:
# save the dataset into csv format for further EDA.
df.to_csv('cleaned_data.csv',index=False)